x = ['Здравствуй, ', 'мир!']
y = str()
for i in x:
    y += i
print(y)



char_set = (1047, 1076, 1088, 1072, 1074, 1089, 1090, 1074, 1091, 1081, 44, 32, 1084, 1080, 1088, 33)
print(*map(chr, char_set), sep='')

"""тут используются 2 функции chr и map
функция chr (документация) принимает код символа в кодировке Unicode и возвращает строку содержащую этот символ 
(в питоне нет типа "один символ", поэтому приходится обходиться строками длинной в 1).
Вот так можно получить номера символов искомой строки (ord – это функция обратная chr).
for sym in "Здравствуй, мир!":
    print("Символ", sym, "его номер", ord(sym))
Не уверен, что в этом курсе вообще будет проходиться функция map(документация), но всё же она не редко применяется.
она принимает функцию и итерируемый объект (то есть объект по которому можно проитерироваться (например, циклом for), 
например, строка, список или генератор). Она применяет функцию к каждому элементу итерируемого объекта и возвращает 
итерируемый объект из результатов применения функции.
В принципе map можно заменить циклом for (но будет работать медленнее (просто для справки, в данном примере это, конечно,
 вообще не принципиально), и займёт больше строк кода).
result = []
for num in (1047, 1076, 1088, 1072, 1074, 1089, 1090, 1074, 1091, 1081, 44, 32, 1084, 1080, 1088, 33):
    result += [chr(num)]
print(*result, sep='')
sep в вызове функции print – это необязательный аргумент (то есть если его явно не указать, то его значение будет равно 
заранее установленному, этот аргумент по умолчанию " ") – символ, который будет вставлен между аргументами при печати
например
print("Один", "Два", "Три", sep="Разделитель")
напечатает ОдинРазделительДваРазделительТри
Звёздочка перед map распаковывает итерируемый объект, то есть каждый элемент будет передан 
в функцию print как отдельный аргумент.
"""


def Hello():
    print('Здравствуй, мир!')
Hello()


for i in range(1, 100):
    z = "З"
    d = "д"
    r = "р"
    a = "а"
    v = "в"
    s = "с"
    t = "т"
    w = "в"
    u = "у"
    y = "й,"
    mir = "ирм!"
print(z,d,r,a,v,s,t,w,u,y, sep = "", end = " ")
print(mir[2], mir[0], mir[1], mir[3], sep = "")


__import__('sys').stdout.write('Здравствуй, мир!')


for sym in "Здравствуй, мир!":
    print("Символ", sym, "его номер", ord(sym))





