a = int(input())
b = a + 1
c = a - 1
print("Следующее за числом", a, "число:", b)
print("Для числа", a, "предыдущее число:", c)



n = int(input())
print('Следующее за числом', n, 'число:', n + 1)
print('Для числа', n, 'предыдущее число:', n - 1)



a = int(input())
print(f"Следующее за числом {a} число: {a+1}")
print(f"Для числа {a} предыдущее число: {a-1}")


number = int(input())
print("Следующее за числом {} число: {}".format(number, number + 1))
print("Для числа {} предыдущее число: {}".format(number, number - 1))


a = int(input())
print(f'Следующее за числом {a} число: {a + 1}\nДля числа {a} предыдущее число: {a - 1}')