n = int(input())
print('Цифра в позиции тысяч равна', n//1000)
print('Цифра в позиции сотен равна', n%1000//100)
print('Цифра в позиции десятков равна', n%100//10)
print('Цифра в позиции единиц равна', n%10)


a = input()
b = ['тысяч', 'сотен', 'десятков', 'единиц']
for i in range(4):
    print('Цифра в позиции ' + b[i] + ' равна ' + a[i])



a,b,c,d=input()
print('Цифра в позиции тысяч равна '+a,'Цифра в позиции сотен равна '+b,'Цифра в позиции десятков равна '+c,'Цифра в позиции единиц равна '+d, sep='\n')


l, _range = list(input()), ['тысяч', 'сотен', 'десятков', 'единиц']
[print('Число ' + _range[i] + ' равно ' + l[i]) for i in range(4)]

inp = list(input())
word = ('тысяч', 'сотен', 'десятков', 'единиц')
[print('Цифра в позиции', word[i], 'равна', inp[i]) for i in range(len(word))]

print(*(f'Цифра в позиции {a[0]} равна {a[1]}' for a in zip(('тысяч', 'сотен', 'десятков', 'единиц'), input())), sep='\n')


num = input()
digits = ['тысяч', 'сотен', 'десятков', 'единиц']
for i in range(4):
    print(f'Цифра в позиции {digits[i]} равна {num[i]}')


for i, k in zip(input(), 'тысяч сотен десятков единиц'.split()):
    print(f'Цифра в позиции {k} равна {i}')

(lambda n, s: print(*[f'Цифра в позиции {s[i] if i < len(s) else i + 1} равна {n[i]}' for i in range(len(n))[::-1]], sep='\n'))(input()[::-1], ['единиц', 'десятков', 'сотен', 'тысяч',])


print('''Цифра в позиции тысяч равна {}
Цифра в позиции сотен равна {}
Цифра в позиции десятков равна {}
Цифра в позиции единиц равна {}'''.format(*list(input())))


a, b, c, d = input()
print(f'Цифра в позиции тысяч равна {a}\nЦифра в позиции сотен равна {b}\nЦифра в позиции десятков равна {c}\nЦифра в позиции единиц равна {d}')

"""решение со словарями, списками и циклом без арифметических операций."""

num = input()
dict = {
    'тысяч': num[0],
    'сотен': num[1],
    'десятков': num[2],
    'единиц': num[3]
}
for word in dict:
    print('Цифра в позиции', word, 'равна', dict[word])

a=list(input())
d = {1:'тысяч', 2:'сотен', 3:'десятков',4:'единиц',}
for i in range (0,4):
    print ('Цифра в позиции %s равна %s'  % (d[i+1],a[i]))

print(f'{(a := "Цифра в позиции")} тысяч {(b := "равна")} {(t := [i for i in input()])[0]}\n{a} сотен {b} {t[1]}\n{a} десятков {b} {t[2]}\n{a} единиц {b} {t[3]}')





def disassemble(x):

    """x - не отрицательное целое число. Вывод организован от младших разрядов к старшим построчно."""

    a = len(str(x))

    s = []

    for i in range(a):

        s += [(x % 10 ** (i + 1) // 10 ** i)]

    return s[::-1]






it = iter(("тысяч", "сотен", "десятков", "единиц"))
intstr = input()
for i in intstr:
    print(f"Цифра в позиции {next(it)} равна {i}")



print((lambda s: f'Цифра в позиции тысяч равна {s[0]}\nЦифра в позиции сотен равна {s[1]}\nЦифра в позиции десятков равна {s[2]}\nЦифра в позиции единиц равна {s[3]}')(input()))











